docs/index.md
```plantuml
@startuml

interface Shape {
    +toOutputObject(): ShapeOutput
    +toString(): string
}

class ShapeOutput {
    - lines: string[]
    - width: number
    - height: number
}

class Printer {
    +stars(count=1): string
    +hashtags(count=1): string
    +spaces(count=1): string
}

class HashtagsRectangle implements Shape
class LeftStarsTriangle implements Shape
class RightStarsTriangle implements Shape
class TreeLevel implements Shape
class TopOrnament implements Shape
class Tree implements Shape

Shape <|.. HashtagsRectangle
Shape <|.. LeftStarsTriangle
Shape <|.. RightStarsTriangle
Shape <|.. TreeLevel
Shape <|.. TopOrnament
Shape <|.. Tree

TreeLevel --> LeftStarsTriangle
TreeLevel --> RightStarsTriangle

Tree --> TopOrnament
Tree --> TreeLevel
Tree --> HashtagsRectangle

@enduml
```
